<?php
/*
Лабораторна робота №2
Нижче відображенні змінні
*/
	(integer) $x = 286;
	(integer) $y = 17;
	(float) $z = ($x+21*$y)/(14*$x+86) - 1073;
	// Відображення початкових змінних та відповіді на екрані
	 echo "<b>Дано:</b>"."<br>";
	 echo "<b>X</b> = $x"."<br>"."<b>Y</b> = $y"."<br>"."<br>";
	 # Відображення формули розрахунку на екрані
	 echo "<b>Формула за варіантом:</b>"."<br>";
	 echo "&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; x+21y"."<br>"."<b>Z</b> = --------- - 1069"."<br>"."&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 14x+86"."<br>"."<br>";
	 echo "<b>Результат обчислення:</b>"."<br>".  "<b>Z </b>= $z"."<br>";
?>